:PROPERTIES:
:ID:       cd48945d-3cb1-46b1-a4ad-15fe89655d11
:DIR:      /home/cashweaver/proj/roam/attachments/cd48945d-3cb1-46b1-a4ad-15fe89655d11
:ROAM_REFS: https://www.calnewport.com/about/
:END:
#+title: Attention Capital Theory
#+hugo_custom_front_matter: roam_refs '("https://www.calnewport.com/about/")
#+filetags: :@Cal_Newport:attention:
#+author: Cash Weaver
#+date: [2021-12-03 Fri 12:17]
#+startup: overview
#+hugo_auto_set_lastmod: t

#+begin_src emacs-lisp

  (when (org-roam-file-p)
    (when-let*
        ((keyword
          "HUGO_CUSTOM_FRONT_MATTER")
         (raw-roam-refs
          (org-export-get-node-property
           :ROAM_REFS
           (org-element-parse-buffer)))
         (refs
          (split-string
           raw-roam-refs
           " +"))
         (quote-wrapped-refs
          (string-join
           (mapcar
            (lambda (ref)
              (format "\"%s\"" ref))
            refs)
           " "))
         (current-roam-refs
         (or
          (org-roam-get-keyword
           keyword))
         "")
         )
      quote-wrapped-refs
      ;;(if (not (string=
                ;;roam-refs
                ;;current-roam-refs))
          ;;(org-roam-set-keyword
           ;;(downcase keyword)
           ;;(format
            ;;"roam_refs '(%s)"
            ;;roam-refs)))
      ))
#+end_src

#+RESULTS:
: "https://www.calnewport.com/about/"

#+begin_quote
In modern knowledge work, the primary capital resource is human brains; or, more specifically, these brains’ ability to create new value through sustained attention. At the moment, most individuals and organizations are terrible at optimizing this resource, prioritizing instead the convenience and flexibility of persistent, unstructured messaging (e.g.,  email and IM). I predict that as this sector evolves, we’ll get better at optimizing attention capital, and accordingly leave behind our current culture of communication overload.
#+end_quote
